In [16]:
import numpy as np
import pandas as pd

In [17]:
original = pd.read_csv("tableConvert.com_lvm0s9.csv")
original.columns = ['Round', 'Category', 'Line1', 'Line2', 'Line3']
original

      Round             Category           Line1   Line2 Line3
0       2.0                Thing            GALE   WINDS   NaN
1       2.0               Phrase    A CHEAP SHOT     NaN   NaN
2       2.0               Phrase     A GREAT BUY     NaN   NaN
3       2.0               Phrase  A KODAK MOMENT     NaN   NaN
4       2.0                Event      A LONG HOT  SHOWER   NaN
...     ...                  ...             ...     ...   ...
3251    2.0         Living Thing           GREAT    DANE   NaN
3252    2.0                Event        SURPRISE   PARTY   NaN
3253    2.0                Event          GARAGE    SALE   NaN
3254    2.0       In The Kitchen         TOASTER    OVEN   NaN
3255    2.0  Fictional Character           BETTY    BOOP   NaN

[3256 rows x 5 columns]

In [18]:
original.drop(["Round"], axis=1)

                 Category           Line1   Line2 Line3
0                   Thing            GALE   WINDS   NaN
1                  Phrase    A CHEAP SHOT     NaN   NaN
2                  Phrase     A GREAT BUY     NaN   NaN
3                  Phrase  A KODAK MOMENT     NaN   NaN
4                   Event      A LONG HOT  SHOWER   NaN
...                   ...             ...     ...   ...
3251         Living Thing           GREAT    DANE   NaN
3252                Event        SURPRISE   PARTY   NaN
3253                Event          GARAGE    SALE   NaN
3254       In The Kitchen         TOASTER    OVEN   NaN
3255  Fictional Character           BETTY    BOOP   NaN

[3256 rows x 4 columns]

In [19]:
new = original["Category"]
new = new.to_frame()
new

                 Category
0                   Thing
1                  Phrase
2                  Phrase
3                  Phrase
4                   Event
...                   ...
3251         Living Thing
3252                Event
3253                Event
3254       In The Kitchen
3255  Fictional Character

[3256 rows x 1 columns]

In [20]:
new["Answer"] = (original['Line1'].fillna('') + ' ' + original['Line2'].fillna('') + ' ' + original['Line3'].fillna('')).str.strip(' ')
new

                 Category             Answer
0                   Thing         GALE WINDS
1                  Phrase       A CHEAP SHOT
2                  Phrase        A GREAT BUY
3                  Phrase     A KODAK MOMENT
4                   Event  A LONG HOT SHOWER
...                   ...                ...
3251         Living Thing         GREAT DANE
3252                Event     SURPRISE PARTY
3253                Event        GARAGE SALE
3254       In The Kitchen       TOASTER OVEN
3255  Fictional Character         BETTY BOOP

[3256 rows x 2 columns]

In [21]:
new.replace('', np.nan, inplace=True)
new = new.dropna()
new

                 Category             Answer
0                   Thing         GALE WINDS
1                  Phrase       A CHEAP SHOT
2                  Phrase        A GREAT BUY
3                  Phrase     A KODAK MOMENT
4                   Event  A LONG HOT SHOWER
...                   ...                ...
3251         Living Thing         GREAT DANE
3252                Event     SURPRISE PARTY
3253                Event        GARAGE SALE
3254       In The Kitchen       TOASTER OVEN
3255  Fictional Character         BETTY BOOP

[3252 rows x 2 columns]

In [22]:
new.to_csv("combined.csv")

In [23]:
what = pd.read_csv("combined.csv")
test = what.sample()
print(test)
print(test['Category'].iloc[0])
print(test['Answer'].iloc[0])
test

      Unnamed: 0 Category         Answer
2642        2646    Place  BAR AND GRILL
Place
BAR AND GRILL

      Unnamed: 0 Category         Answer
2642        2646    Place  BAR AND GRILL